void REDLIGHT()//红外触发
{
    if (L_redlight == 0  && R_redlight == 0)//双触发的情况
        JD = 90 ;
    //----------------------------------
    else if (L_redlight == 0)//如果左边触发
        JD = 110 ;
    //----------------------------------
    else if (R_redlight == 0)//如果右边触发
        JD = 70 ;
    //----------------------------------
    else guizhong();//无障碍时 归中
}
//#######################################
void DJ_test()//舵机测试
{
	int i ;
    for(i=20 ; i<160 ; i++)
    {
        JD = i ;
        delay(10);
    }
    //--------------------------
    for(i=160 ; i>20 ; i--)
    {
        JD = i ;
        delay(10);
    }
}